---
kind: property
id: P:Autodesk.Revit.DB.City.Longitude
source: html/f9e972be-6053-589b-3a7d-0c7ecaf6f831.htm
---
# Autodesk.Revit.DB.City.Longitude Property

Longitude of the city

## Syntax (C#)
```csharp
public double Longitude { get; }
```

## Remarks
A read only property that contains the longitude of the city.
The value returned is in radians, ranging from -PI to +PI.